# ИУ5-81Б
# Анцифров Никита
# Лабораторная работа №1
# Вариант 3

# Установка пакетов:
# install.packages("lpSolve")

# Состав КИС:
# С1 - серверные
# C2 - рабочие станции аналитиков и менеджеров
# C3 - рабочие станции обслуживающего персонала
# C4 - станции сопряжения с видео- и аудио-оборудованием

# N1 - количество комьютеров сегмента C1   |    5  <= N1 <= 8
# N2 - количество комьютеров сегмента C2   |    6  <= N2 <= 22
# N3 - количество комьютеров сегмента C3   |    10 <= N3 <= 21
# N4 - количество комьютеров сегмента C4   |    7  <= N4 <= 8

# Сохраним эти значения :
n11 = 5
n12 = 8
n21 = 6
n22 = 22
n31 = 10
n32 = 21
n41 = 7
n42 = 8

# Прочитаем Computers.csv:
Data<-read.csv("Computers.csv",sep=",")
View(Data)

# Выразим стоимость отдельного компьютера через регрессионную зависимость через параметры speed, ram и hd:
Res<-lm(price~speed+ram+hd, Data)
Res

# Сохраним коэффициенты:
k1 = round(summary(Res)$coefficients[1], 4) # k1 =  1492.1775
k2 = round(summary(Res)$coefficients[2], 4) # k2 =  5.8112
k3 = round(summary(Res)$coefficients[3], 4) # k3 =  78.2357
k4 = round(summary(Res)$coefficients[4], 4) # k4 = -0.5357

# Зависимость цены:
# price ~ 1492.1775 + 5.8112*speed + 78.2357*ram - 0.5357*hd
# price ~ k1        + k2    *speed + k3     *ram + k4    *hd

# Вычислим среднее по столбцам:
mean_speed = mean(Data$speed)
mean_hd = mean(Data$hd)
mean_ram = mean(Data$ram)

# Общая средняя стоимость:
mean(Data$price)

# Установим критерий для верхнего уровня:
#
# S - стоимость развёртывания КИС
#
# S = N1*price1 + N2*price2 + N3*price3 + N4*price4 -> min
#
# S = 1492.1775*N1 + 5.8112*speed1*N1 + 78.2357*ram1*N1 - 0.5357*hd1*N1 +
#     1492.1775*N2 + 5.8112*speed2*N2 + 78.2357*ram2*N2 - 0.5357*hd2*N2 +
#     1492.1775*N3 + 5.8112*speed3*N3 + 78.2357*ram3*N3 - 0.5357*hd3*N3 +
#     1492.1775*N4 + 5.8112*speed4*N4 + 78.2357*ram4*N4 - 0.5357*hd4*N4
#
# S = k1*N1 + k2*speed1*N1 + k3*ram1*N1 + k4*hd1*N1 +
#     k1*N2 + k2*speed2*N2 + k3*ram2*N2 + k4*hd2*N2 +
#     k1*N3 + k2*speed3*N3 + k3*ram3*N3 + k4*hd3*N3 +
#     k1*N4 + k2*speed4*N4 + k3*ram4*N4 + k4*hd4*N4

# Поставим ограничения на суммарную стоимость в сегментах:
# Суммарная стоимость для C1 должна быть не более 18000   |     N1*price1 <= 18000
# Суммарная стоимость для C2 должна быть не более 25000   |     N2*price2 <= 25000
# Суммарная стоимость для C3 должна быть не более 30000   |     N3*price3 <= 30000
# Суммарная стоимость для C4 должна быть не более 22000   |     N4*price4 <= 22000

# Сохраним значения:
pr1 = 18000
pr2 = 25000
pr3 = 30000
pr4 = 22000

# Введем переменные xi:

# 1492.1775 * N1 = x1   |   1492.1775  * 5  <=  x1   <= 1492.1775   * 8     |   k1          * n11  <=  x1   <= k1           * n12     
# speed1    * N1 = x2   |   mean_speed * 5  <=  x2   <= mean_speed  * 8     |   mean_speed  * n11  <=  x2   <= mean_speed   * n12      
# ram1      * N1 = x3   |   mean_ram   * 5  <=  x3   <= mean_ram    * 8     |   mean_ram    * n11  <=  x3   <= mean_ram     * n12         
# hd1       * N1 = x4   |   mean_hd    * 5  <=  x4   <= mean_hd     * 8     |   mean_hd     * n11  <=  x4   <= mean_hd      * n12   
# 
# 1492.1775 * N2 = x5   |   1492.1775  * 6  <=  x5   <= 1492.1775   * 22    |   k1          * n21  <=  x5   <= k1           * n22      
# speed2    * N2 = x6   |   mean_speed * 6  <=  x6   <= mean_speed  * 22    |   mean_speed  * n21  <=  x6   <= mean_speed   * n22      
# ram2      * N2 = x7   |   mean_ram   * 6  <=  x7   <= mean_ram    * 22    |   mean_ram    * n21  <=  x7   <= mean_ram     * n22      
# hd2       * N2 = x8   |   mean_hd    * 6  <=  x8   <= mean_hd     * 22    |   mean_hd     * n21  <=  x8   <= mean_hd      * n22      
# 
# 1492.1775 * N3 = x9   |   1492.1775  * 10 <=  x9   <= 1492.1775   * 21    |   k1          * n31  <=  x9   <= k1           * n32          
# speed3    * N3 = x10  |   mean_speed * 10 <=  x10  <= mean_speed  * 21    |   mean_speed  * n31  <=  x10  <= mean_speed   * n32          
# ram3      * N3 = x11  |   mean_ram   * 10 <=  x11  <= mean_ram    * 21    |   mean_ram    * n31  <=  x11  <= mean_ram     * n32          
# hd3       * N3 = x12  |   mean_hd    * 10 <=  x12  <= mean_hd     * 21    |   mean_hd     * n31  <=  x12  <= mean_hd      * n32          
# 
# 1492.1775 * N4 = x13  |   1492.1775  * 7  <=  x13  <= 1492.1775   * 8     |   k1          * n41  <=  x13  <= k1           * n42     
# speed4    * N4 = x14  |   mean_speed * 7  <=  x14  <= mean_speed  * 8     |   mean_speed  * n41  <=  x14  <= mean_speed   * n42      
# ram4      * N4 = x15  |   mean_ram   * 7  <=  x15  <= mean_ram    * 8     |   mean_ram    * n41  <=  x15  <= mean_ram     * n42     
# hd4       * N4 = x16  |   mean_hd    * 7  <=  x16  <= mean_hd     * 8     |   mean_hd     * n41  <=  x16  <= mean_hd      * n42      

# Значение критерия верхнего уровня S через xi:
# S = x1  + 5.8112*x2  + 78.2357*x3  - 0.5357*x4  +
#     x5  + 5.8112*x6  + 78.2357*x7  - 0.5357*x8  +
#     x9  + 5.8112*x10 + 78.2357*x11 - 0.5357*x12 +
#     x13 + 5.8112*x14 + 78.2357*x15 - 0.5357*x16
#
# S = x1  + k2*x2  + k3*x3  + k4*x4  +
#     x5  + k2*x6  + k3*x7  + k4*x8  +
#     x9  + k2*x10 + k3*x11 + k4*x12 +
#     x13 + k2*x14 + k3*x15 + k4*x16

# Стоимости нижнего уровня через xi:
# x1   + 5.8112*x2   + 78.2357*x3   - 0.5357*x4   <= 18000
# x5   + 5.8112*x6   + 78.2357*x7   - 0.5357*x8   <= 25000 
# x9   + 5.8112*x10  + 78.2357*x11  - 0.5357*x12  <= 30000
# x13  + 5.8112*x14  + 78.2357*x15  - 0.5357*x16  <= 22000
#
# x1   + k2*x2   + k3*x3   + k4*x4   <= 18000
# x5   + k2*x6   + k3*x7   + k4*x8   <= 25000 
# x9   + k2*x10  + k3*x11  + k4*x12  <= 30000
# x13  + k2*x14  + k3*x15  + k4*x16  <= 22000 

# Определим частные критерии оптимизации на нижнем уровне:
#
# speed + ram в сегменте C1 максимизируется:
# W1 = 0.6 * x2 + 0.4 * x3 -> max
#
# ram + hd в сегменте C2 максимизируется:
# W2 = 0.7 * x7 + 0.3 * x8 -> max
#
# ram в сегменте C3 максимизируется:
# W3 = x11 -> max
#
# hd в сегменте C4 максимизируется:
# W4 = x16 -> max

# Сформируем критерий нижнего уровня:
# G = 0.3 * W1 + 0.25 * W2 + 0.25 * W3 + 0.2 * W4 -> max
# G = 0.3 * 0.6 * x2 + 0.3 * 0.4 * x3 + 0.25 * 0.7 * x7 + 0.25 * 0.3 * x8 + 0.25 * x11 + 0.2 * x16 -> max
#
# G = 0.18 * x2 + 0.12 * x3 + 0.175 * x7 + 0.075 * x8 + 0.25 * x11 + 0.2 * x16 -> max
#
# Сохраним значения:
g2 = 0.18
g3 = 0.12
g7 = 0.175
g8 = 0.075
g11 = 0.25
g16 = 0.2

# Поставленную задачу будем решать методом последовательных уступок.

# Подключим требуемые пакеты:
library(lpSolve)

# Зададим матрицы:
objective.in<-c(1,k2,k3,k4,1,k2,k3,k4,1,k2,k3,k4,1,k2,k3,k4)
#                   x1  x2          x3          x4  x5  x6       x7        x8        x9  x10 x11 x12 x13 x14 x15 x16
const.mat<-matrix(c(0,  g2,         g3,         0,  0,  0,       g7,       g8,       0,  0,  g11, 0,  0,  0,  0,  g16, #1  G
                    1,  k2,         k3,         k4, 0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #2  price1
                    0,  0,          0,          0,  1,  k2,      k3,       k4,       0,  0,  0,   0,  0,  0,  0,  0,   #3  price2
                    0,  0,          0,          0,  0,  0,       0,        0,        1,  k2, k3,  k4, 0,  0,  0,  0,   #4  price3
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  1,  k2, k3, k4,  #5  price4
                    1,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #6  x1
                    1,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #7  
                    0,  1,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #8  x2
                    0,  1,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #9
                    0,  0,          1,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #10 x3
                    0,  0,          1,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #11
                    0,  0,          0,          1,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #12 x4
                    0,  0,          0,          1,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #13
                    0,  0,          0,          0,  1,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #14 x5
                    0,  0,          0,          0,  1,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #15 
                    0,  0,          0,          0,  0,  1,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #16 x6
                    0,  0,          0,          0,  0,  1,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #17
                    0,  0,          0,          0,  0,  0,       1,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #18 x7
                    0,  0,          0,          0,  0,  0,       1,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #19
                    0,  0,          0,          0,  0,  0,       0,        1,        0,  0,  0,   0,  0,  0,  0,  0,   #20 x8
                    0,  0,          0,          0,  0,  0,       0,        1,        0,  0,  0,   0,  0,  0,  0,  0,   #21
                    0,  0,          0,          0,  0,  0,       0,        0,        1,  0,  0,   0,  0,  0,  0,  0,   #22 x9
                    0,  0,          0,          0,  0,  0,       0,        0,        1,  0,  0,   0,  0,  0,  0,  0,   #23
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  1,  0,   0,  0,  0,  0,  0,   #24 x10
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  1,  0,   0,  0,  0,  0,  0,   #25
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  1,   0,  0,  0,  0,  0,   #26 x11
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  1,   0,  0,  0,  0,  0,   #27
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   1,  0,  0,  0,  0,   #28 x12
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   1,  0,  0,  0,  0,   #29
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  1,  0,  0,  0,   #30 x13
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  1,  0,  0,  0,   #31
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  1,  0,  0,   #32 x14
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  1,  0,  0,   #33
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  1,  0,   #34 x15
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  1,  0,   #35
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  1,   #36 x16
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  1),  #37
                  nrow=37,byrow=TRUE)

#             G   price1    price2    price3    price4
const.dir<-c('>=','<=',     '<=',     '<=',     '<=',    
#            x1        x2        x3        x4        x5        x6        x7        x8
             '>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=',
#            x9        x10       x11       x12       x13       x14       x15       x16
             '>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=')

const.rhs<-c(100,pr1,pr2,pr3,pr4,
             k1*n11,          k1*n12,             #x1
             mean_speed*n11,  mean_speed*n12,     #x2
             mean_ram*n11,    mean_ram*n12,       #x3
             mean_hd*n11,     mean_hd*n12,        #x4
             k1*n21,          k1*n22,             #x5
             mean_speed*n21,  mean_speed*n22,     #x6
             mean_ram*n21,    mean_ram*n22,       #x7
             mean_hd*n21,     mean_hd*n22,        #x8
             k1*n31,          k1*n32,             #x9
             mean_speed*n31,  mean_speed*n32,     #x10
             mean_ram*n31,    mean_ram*n32,       #x11
             mean_hd*n31,     mean_hd*n32,        #x12
             k1*n41,          k1*n42,             #x13
             mean_speed*n41,  mean_speed*n42,     #x14
             mean_ram*n41,    mean_ram*n42,       #x15
             mean_hd*n41,     mean_hd*n42)        #x16

Res1<-lp("min", objective.in, const.mat, const.dir, const.rhs)
Res1$solution

# Cнова зададим матрицы:
objective.in<-c(0,g2,g3,0,0,0,g7,g8,0,0,g11,0,0,0,0,g16)
#                   x1  x2          x3          x4  x5  x6       x7        x8        x9  x10 x11 x12 x13 x14 x15 x16
const.mat<-matrix(c(1,  k2,         k3,         k4, 1,  k2,      k3,       k4,       1,  k2, k3,  k4, 1,  k2, k3, k4,  #1  S
                    1,  k2,         k3,         k4, 0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #2  price1
                    0,  0,          0,          0,  1,  k2,      k3,       k4,       0,  0,  0,   0,  0,  0,  0,  0,   #3  price2
                    0,  0,          0,          0,  0,  0,       0,        0,        1,  k2, k3,  k4, 0,  0,  0,  0,   #4  price3
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  1,  k2, k3, k4,  #5  price4
                    1,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #6  x1
                    1,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #7  
                    0,  1,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #8  x2
                    0,  1,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #9
                    0,  0,          1,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #10 x3
                    0,  0,          1,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #11
                    0,  0,          0,          1,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #12 x4
                    0,  0,          0,          1,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #13
                    0,  0,          0,          0,  1,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #14 x5
                    0,  0,          0,          0,  1,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #15 
                    0,  0,          0,          0,  0,  1,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #16 x6
                    0,  0,          0,          0,  0,  1,       0,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #17
                    0,  0,          0,          0,  0,  0,       1,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #18 x7
                    0,  0,          0,          0,  0,  0,       1,        0,        0,  0,  0,   0,  0,  0,  0,  0,   #19
                    0,  0,          0,          0,  0,  0,       0,        1,        0,  0,  0,   0,  0,  0,  0,  0,   #20 x8
                    0,  0,          0,          0,  0,  0,       0,        1,        0,  0,  0,   0,  0,  0,  0,  0,   #21
                    0,  0,          0,          0,  0,  0,       0,        0,        1,  0,  0,   0,  0,  0,  0,  0,   #22 x9
                    0,  0,          0,          0,  0,  0,       0,        0,        1,  0,  0,   0,  0,  0,  0,  0,   #23
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  1,  0,   0,  0,  0,  0,  0,   #24 x10
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  1,  0,   0,  0,  0,  0,  0,   #25
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  1,   0,  0,  0,  0,  0,   #26 x11
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  1,   0,  0,  0,  0,  0,   #27
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   1,  0,  0,  0,  0,   #28 x12
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   1,  0,  0,  0,  0,   #29
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  1,  0,  0,  0,   #30 x13
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  1,  0,  0,  0,   #31
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  1,  0,  0,   #32 x14
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  1,  0,  0,   #33
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  1,  0,   #34 x15
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  1,  0,   #35
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  1,   #36 x16
                    0,  0,          0,          0,  0,  0,       0,        0,        0,  0,  0,   0,  0,  0,  0,  1),  #37
                  nrow=37,byrow=TRUE)

#             S   price1    price2    price3    price4
const.dir<-c('<=','<=',     '<=',     '<=',     '<=',    
             #            x1        x2        x3        x4        x5        x6        x7        x8
             '>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=',
             #            x9        x10       x11       x12       x13       x14       x15       x16
             '>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=','>=','<=')

const.rhs<-c(100000,pr1,pr2,pr3,pr4,
             k1*n11,          k1*n12,             #x1
             mean_speed*n11,  mean_speed*n12,     #x2
             mean_ram*n11,    mean_ram*n12,       #x3
             mean_hd*n11,     mean_hd*n12,        #x4
             k1*n21,          k1*n22,             #x5
             mean_speed*n21,  mean_speed*n22,     #x6
             mean_ram*n21,    mean_ram*n22,       #x7
             mean_hd*n21,     mean_hd*n22,        #x8
             k1*n31,          k1*n32,             #x9
             mean_speed*n31,  mean_speed*n32,     #x10
             mean_ram*n31,    mean_ram*n32,       #x11
             mean_hd*n31,     mean_hd*n32,        #x12
             k1*n41,          k1*n42,             #x13
             mean_speed*n41,  mean_speed*n42,     #x14
             mean_ram*n41,    mean_ram*n42,       #x15
             mean_hd*n41,     mean_hd*n42)        #x16

Res2<-lp("max", objective.in, const.mat, const.dir, const.rhs)
Res2$solution

# Критерии:
S<-function(p){return(sum(c(1,k2,k3,k4,1,k2,k3,k4,1,k2,k3,k4,1,k2,k3,k4)*p))}
G<-function(p){return(sum(c(0,g2,g3,0,0,0,g7,g8,0,0,g11,0,0,0,0,g16)*p))} 

# Решения:
S(Res1$solution)
G(Res1$solution)
S(Res2$solution)
G(Res2$solution)

# Получим координаты идеальных точек для каждого сегмента:
x <- Res2$solution

N1 <- floor(x[1]/k1)
resC1 <- c(x[2]/N1,x[3]/N1,x[4]/N1)

N2 <- floor(x[5]/k1)
resC2 <- c(x[6]/N2,x[7]/N2,x[8]/N2)

N3 <- floor(x[9]/k1)
resC3 <- c(x[10]/N3,x[11]/N3,x[12]/N3)

N4 <- floor(x[13]/k1)
resC4 <- c(x[14]/N4,x[15]/N4,x[16]/N4)

resC1
resC2
resC3
resC4

# Пусть для сегмента C1 главными показателями будут speed, hd и ram
# Пусть для сегмента C2 главными показателями будут hd, ram и multi
# Пусть для сегмента C3 главными показателями будут cd и multi
# Пусть для сегмента C4 главными показателями будут speed, hd, ram, multi и cd

# Поставим ограничения на эти показатели:
# Для C1: speed > 50      hd    >  500     ram   >= 8
# Для C2: hd    > 400     ram   >= 8       multi =  yes
# Для C3: cd    = yes     multi =  yes
# Для C4: speed > 50      hd    >  400     ram   >= 8       cd = yes      multi = yes

# Выберем варианты, удовлетворяющие условиям работоспособности:

nC1 <-list()
for (i in c(1:length(rownames(Data))))
{
  if ((Data[i,3]>50) & (Data[i,4]>500) & (Data[i,5]>=8))
    nC1<-rbind(nC1, i)
}
nrow(nC1)

nC2 <-list()
for (i in c(1:length(rownames(Data))))
{
  if ((Data[i,4]>400) & (Data[i,5]>=8) & (Data[i,8]=="yes"))
    nC2<-rbind(nC2, i)
}
nrow(nC2)

nC3 <-list()
for (i in c(1:length(rownames(Data))))
{
  if ((Data[i,7]=="yes") & (Data[i,8]=="yes"))
    nC3<-rbind(nC3, i)
}
nrow(nC3)

nC4 <-list()
for (i in c(1:length(rownames(Data))))
{
  if ((Data[i,3]>50) & (Data[i,4]>400) & (Data[i,5]>=8) & (Data[i,7]=="yes") & (Data[i,8]=="yes"))
    nC4<-rbind(nC4, i)
}
nrow(nC4)

# Приведем все конструктивные показатели к однонаправленной шкале [0,100], направление улучшения - возрастание показателя:

p <- list()
for (i in colnames(Data))
{
  if (i!="X"){
    if ((i=="cd") || (i=="multi") || (i=="premium"))
    {
      
      p[i] <- lapply(subset(Data,select=i), {function(x) sapply(x,{function(c) if (c=="yes") 100 else 0})})
    } else {
      mmax <- max(subset(Data,select=i))
      mmin <- min(subset(Data,select=i))
      p[i] <- (subset(Data,select=i)-mmin)*100/(mmax-mmin)
    }}
  else
    p[i]<-subset(Data,select=i)
}
WW<-data.frame(p)  
rownames(WW)<-rownames(Data)

C1 <-data.frame()
C2 <-data.frame()
C3 <-data.frame()
C4 <-data.frame()
for (i in c(1:length(rownames(WW))))
{
  if (!is.na(match(WW[i,1],nC1)))
    C1<-rbind(C1, WW[i,c(3,4,5)])
  if (!is.na(match(WW[i,1],nC2)))
    C2<-rbind(C2, WW[i,c(3,4,5)])
  if (!is.na(match(WW[i,1],nC3)))
    C3<-rbind(C3, WW[i,c(3,4,5)]) 
  if (!is.na(match(WW[i,1],nC4)))
    C4<-rbind(C4, WW[i,c(3,4,5)])
}

# Выделим эффективные по Парето решения:
pareto <- function(df)
{
  result<-c()
  for (i in c(1:length(rownames(df)))){
    p<-TRUE
    for (j in c(1:length(rownames(df)))){
      if (DPareto(df[j,],df[i,]))
        p<-FALSE}
    if (p) result<-c(result, rownames(df)[i])
  }
  return(result)
}

DPareto<-function(X,Y){
  p<-TRUE; l<-FALSE; i<-1;
  while (p & (i<=length(X))){
    if (X[i]<Y[i]) p<-FALSE
    if (X[i]>Y[i]) l<-TRUE
    i<-i+1
  }
  if (!p | !l) return(FALSE)
  else return(TRUE)
}

C1 <- C1[pareto(C1),]
nrow(C1)

C2 <- C2[pareto(C2),]
nrow(C2)

C3 <- C3[pareto(C3),]
nrow(C3)

C4 <- C4[pareto(C4),]
nrow(C4)

# Определим расстояние каждого Парето-оптимального решения до идеальной точки через евклидову метрику:

dist<-function(A, B){
  return(sqrt(sum((A-B)^2)))}

optC1<-C1[which.min(dist(c(C1$speed, C1$ram, C1$hd), resC1)), ]
Data[row.names(optC1),]

optC2<-C2[which.min(dist(c(C2$speed, C2$ram, C2$hd), resC2)), ]
Data[row.names(optC2),]

optC3<-C3[which.min(dist(c(C3$speed, C3$ram, C3$hd), resC3)), ]
Data[row.names(optC3),]

optC4<-C4[which.min(dist(c(C4$speed, C4$ram, C4$hd), resC4)), ]
Data[row.names(optC4),]

# Сделаем окончательные выводы:

cat('C1: количество - ', N1, ', номер варианта - ', row.names(optC1), '\n')
cat('C2: количество - ', N2, ', номер варианта - ', row.names(optC2), '\n')
cat('C3: количество - ', N3, ', номер варианта - ', row.names(optC3), '\n')
cat('C4: количество - ', N4, ', номер варианта - ', row.names(optC4), '\n')